/////////////////////////////////////////////////////////////////////////////////////////////////
///1 - Напишите программу, чтобы проверить, содержит ли данная строка только цифры.//////////////
///(с возможностью ввода или нет решайте сами)///////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////

/* package GB_java_education.second_seminar.dz_2_seminar;

import java.util.Scanner;

public class main {
    String regex = "[0-9]+"; //почитал в интернете, вроде, это самый простой способ задать цифры.
    
    Scanner iScanner = new Scanner(System.in); // пусть пользователь все-таки вводит число.
    System.out.println("Введите число");
    int my_number = Integer.parseInt(iScanner.nextLine());
    iScanner.close();


    System.out.println(my_number.matches(regex)); // метод match вроде должен все проверять
    
} */

/////////////////////////////////////////////////////////////////////////////////////////////////

