/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*
 * Задание:
 * Видоизмените программу, созданную в упражнении 1.2, таким образом, чтобы она выводила таблицу перевода дюймов в метры.
 * Выведите значение длины до 12 футов через каждый дюйм. После каждых 12 дюймов выведите пустую строку.
 * (Один метр приблизительно равен 39.37 дюйма, в одном футе 12 дюймов)
 */
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


package GB_java_education.first_seminar.DZ_1_seminar;

public class inches_meters {
    public static void main(String[] args) {
		double meter;
		int counter;
		int inch;
		int foot;

		counter = 0;    
		foot = 12 * 12;

		for (inch = 1; inch <= foot; inch++) {
			meter = inch / 39.37;

			System.out.println(inch + " дюйму соотвествует " + meter + " метра.");

			counter++;

			if (counter == 12) {    
				System.out.println();
				counter = 0;
			}
		}
	}
}
