// package GB_java_education.sixth_seminar;

// import java.util.HashSet;

/////////////////////////////////////////////////////////////////////////////////////////////////
///// Напишите метод, который заполнит массив из 1000 элементов случайными цифрами от 0 до 24////
/////////////////////////////////////////////////////////////////////////////////////////////////

/* 
public class main
{
	public int[] initArray(){
        int[] array = new int[1000];
        for (int i = 0; i < array.length; i++) {
            array[i] = (int) Math.round((Math.random() * 25)); // Пытался сделать через array[i] = random.nextInt(25), но выдало ошибку. Так и не понял почему
        }
        return array;
    }
  
} */

/////////////////////////////////////////////////////////////////////////////////////////////////





